Revit 2024 API
WallpaintApplicationType Enumeration
 The enumerated type representing the permitted values for the asset property "WallpaintApplication" from the "WallPaint" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public enum WallpaintApplicationType
Visual Basic
Public Enumeration WallpaintApplicationType
Visual C++
public enum class WallpaintApplicationType
Members
Member name | Description
Roller
Brush
Spray
See Also
Autodesk.Revit.DB.Visual Namespace